spec/fixtures/vcr_cassettes/SolidusBolt_Transactions_DetailService/_call/makes_the_API_call.yml

---
http_interactions:
- request:
    method: get
    uri: https://sandbox.bolttk.com/public_key
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Content-Type:
      - application/text; charset=utf-8
      Content-Length:
      - '44'
      Connection:
      - keep-alive
      Date:
      - Tue, 10 May 2022 17:38:08 GMT
      X-Amzn-Requestid:
      - 51e02956-5d0f-4223-973f-977830dc54b7
      Access-Control-Allow-Origin:
      - "*"
      Strict-Transport-Security:
      - max-age=31536000; includeSubDomains; preload
      X-Amzn-Remapped-Content-Length:
      - '44'
      X-Amzn-Remapped-Connection:
      - close
      X-Amz-Apigw-Id:
      - R65oEGzKyK4FXWw=
      Cache-Control:
      - public, max-age=604800
      X-Powered-By:
      - Express
      X-Amzn-Trace-Id:
      - Root=1-627aa300-51e44b7762e7b6ab64c63f94
      X-Amzn-Remapped-Date:
      - Tue, 10 May 2022 17:38:08 GMT
      Via:
      - 1.1 925a9355525ad52853e1025fe231bef8.cloudfront.net (CloudFront), 1.1 ee330666adf9f04c8c30094f8ddcd004.cloudfront.net
        (CloudFront)
      X-Amz-Cf-Pop:
      - HIO50-C2
      - SEA73-P1
      Etag:
      - W/"2c-qVZerSDDiabAHoqCi/o+02DcdQI"
      X-Cache:
      - Hit from cloudfront
      X-Amz-Cf-Id:
      - HsXas7XEaF_iYS5rDdnoEQKRhFE-IAc-jH90sMGyoAtNW9qptPFEEQ==
      Age:
      - '41887'
    body:
      encoding: UTF-8
      string: SnTw15miTFwqwPnqn95Xurm049JaNGWdKX38id7/Lik=
  recorded_at: Wed, 11 May 2022 05:16:16 GMT
- request:
    method: post
    uri: https://sandbox.bolttk.com/token
    body:
      encoding: UTF-8
      string: '{"payload":"2VYCTQ5bvqa2aZTyzSGC8fH9vO76wlLTN2dON56a4ER4MhlbfyfbrrgUaWTk\npwHg51b40mc=\n","nonce":"NTQ1MjgwMzIwODU1NTAyMzc5OTA0ODMw\n","public_key":"jOscXiiZCsn+nfXFetBF+3On0nAWgedP87ZbJUKizDw=\n"}'
    headers:
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Content-Type:
      - application/json; charset=utf-8
      Content-Length:
      - '273'
      Connection:
      - keep-alive
      Date:
      - Wed, 11 May 2022 05:16:16 GMT
      X-Amzn-Requestid:
      - c6f52324-2a7c-4324-9fcc-4416f5f42333
      Access-Control-Allow-Origin:
      - "*"
      Strict-Transport-Security:
      - max-age=31536000; includeSubDomains; preload
      X-Amzn-Remapped-Content-Length:
      - '273'
      X-Amzn-Remapped-Connection:
      - close
      X-Amz-Apigw-Id:
      - R8f5GEUhyK4FW6A=
      Etag:
      - W/"111-jDuSKdYvldgGJYJ72Xze91j93J0"
      X-Powered-By:
      - Express
      X-Amzn-Trace-Id:
      - Root=1-627b46a0-6f5c0a42491e536041d638b7
      X-Amzn-Remapped-Date:
      - Wed, 11 May 2022 05:16:16 GMT
      Via:
      - 1.1 6cdcb30f11623b126d7593a56d3a4690.cloudfront.net (CloudFront), 1.1 9c675215120a4ade8754c4357ef2f3ea.cloudfront.net
        (CloudFront)
      X-Amz-Cf-Pop:
      - SEA73-P1
      - YVR50-C1
      X-Cache:
      - Miss from cloudfront
      X-Amz-Cf-Id:
      - d7wONV_LdSbjh7CeieDJVv54C2aDLPELeokPvpA5URHdmdYHpDAraA==
    body:
      encoding: UTF-8
      string: '{"payload":"Q0eQ1A7mwr1nkPBjrxaCYRpX+QbzaQj7ELRCCuz4bTte5E2M/pMJw3e+LYguFNgxz6bcfmaF0VdI+TRE0gfJyop3v9duL++zdGxRKN47Om6RjMBg1BoWSn+kiKDveX7jw6m0hKY0g/XuVoAiTRmvgp5XwhWpNOc4xRYYQDNdaW8g58BEo4UoarNnORwi45ezveDY+kg8GgPLfoOWaTELp3h1","nonce":"2G1y1eByUNxXhGkIsPW7qajKwe0OLP+p"}'
  recorded_at: Wed, 11 May 2022 05:16:16 GMT
- request:
    method: post
    uri: https://api-sandbox.bolt.com/v1/merchant/transactions/authorize
    body:
      encoding: UTF-8
      string: '{"auto_capture":false,"cart":{"total_amount":11000,"order_reference":"R502198337","currency":"USD","items":[{"sku":"SKU-1","name":"Product
        #1 - 4860","unit_price":1000,"quantity":1}]},"credit_card":{"token":"1bbea32008aa500306d0ca290b8b8fcea1cf407da0666b6d5e38dc50bde37228","expiry":1652247076487,"last4":"1004","bin":"411111","network":"visa","expiration":"2023-05","token_type":"bolt"},"division_id":"","source":"direct_payments","user_identifier":{"email":"email1@example.com","phone":"555-555-0199"},"user_identity":{"first_name":"John","last_name":"Doe"},"create_bolt_account":false}'
    headers:
      Content-Type:
      - application/json
      X-Nonce:
      - a4ecff604a0be1712928f6489c35f38b
      X-Publishable-Key:
      - "<PUBLISHABLE_KEY>"
      X-Api-Key:
      - db1bd1ff3631f9c3e30d3555ad2989fa7cbed58b2344aea911aa7e2d52dba3e3
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Wed, 11 May 2022 05:16:18 GMT
      Content-Type:
      - application/json; charset=UTF-8
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
      Public-Key-Pins-Report-Only:
      - max-age=2592000;pin-sha256="OGAVOYhLZd3ADKYGFZOED1c5m1ObMlRv9PyIWrO4Nd0=";pin-sha256="RRM1dGqnDFsCJXBTHky16vi1obOlCgFFn/yOhI/y+ho=";pin-sha256="IXHYSIdST+XY22J5ivybYkntMIfjA5P6pMKX2hWG1BE=";report-uri="https://77aa1bd121ef22d50247a23390ce6cff.report-uri.io/r/default/hpkp/reportOnly"
      Set-Cookie:
      - trk=1f707d9e-27d0-4ffd-93c6-efe5e2274bba; Path=/; Max-Age=31536000; HttpOnly;
        Secure; SameSite=None
      Strict-Transport-Security:
      - max-age=31536000; includeSubDomains; preload
      X-Bolt-Api-Version:
      - '2022-01-01'
      X-Bolt-Trace-Id:
      - Root=1-627b46a1-628ab1b0602ef1fa29cec6af
      X-Device-Id:
      - 401c0dcb791217fc4e140ffea60600d05e52c1afc491c015e3110557751e724b
      X-Envoy-Upstream-Service-Time:
      - '1165'
      Server:
      - envoy
    body:
      encoding: UTF-8
      string: '{"transaction":{"id":"TA6ycQqjStRQ9","type":"cc_payment","processor":"vantiv","date":1652246177175,"reference":"BR6G-B6KH-WXBX","status":"pending","from_consumer":{"id":"CA3WXceXonaTM","first_name":"John","last_name":"Doe","phones":[{"id":"","number":"+1
        5555550199","country_code":"1","status":"","priority":""}],"emails":[{"id":"","address":"email1@example.com","status":"","priority":""}],"email_verified":false,"platform_account_status":"none"},"to_consumer":{"id":"CAgqtmLcWPErV","first_name":"Daniele","last_name":"Palombo","phones":[{"id":"PAkJjgMi179yV","number":"5555555555","country_code":"1","status":"pending","priority":"primary"}],"emails":[{"id":"EAmCbHaM6E7v8","address":"danielepalombo@nebulab.com","status":"active","priority":"primary"}],"email_verified":false,"platform_account_status":"none"},"from_credit_card":{"id":"CAhp2hhyKhdRv","last4":"1004","bin":"411111","expiration":1682899200000,"network":"visa","token_type":"bolt","priority":"listed","display_network":"Visa","icon_asset_path":"img/issuer-logos/visa.png","status":"active"},"amount":{"amount":11000,"currency":"USD","currency_symbol":"$"},"authorization":{"auth":"84076958166069130","reason":"none","status":"succeeded"},"captures":null,"merchant_division":{"id":"MA9hYSVYJ12VA","merchant_id":"MA5Ho7ftc4HPz","public_id":"Rq4qB1QajYLn","description":"Daniele
        Palombo (Nebulab)","display_name":"Solidus","logo":{"domain":"img-sandbox.bolt.com","resource":""},"platform":"none","hook_url":"https://918c9efe2fcf.ngrok.io/webhooks","hook_type":"bolt","is_universal_merchant_api":true,"is_webhooks_v2":true,"shipping_url":"","tax_url":"","debug_url":"https://asdf.ngrok.com/webhooks","confirmation_redirect_url":""},"transaction_properties":{"avs_result":"34","cvv_result":"M"},"indemnification_decision":"not_indemnified","indemnification_reason":"direct_payments","splits":[{"amount":{"amount":11000,"currency":"USD","currency_symbol":"$"},"type":"net"},{"amount":{"amount":0,"currency":"USD","currency_symbol":"$"},"type":"processing_fee"},{"amount":{"amount":0,"currency":"USD","currency_symbol":"$"},"type":"bolt_fee"}],"review_ticket":{"request_deadline":1652534177175}},"did_create_bolt_account":false}'
  recorded_at: Wed, 11 May 2022 05:16:18 GMT
- request:
    method: get
    uri: https://api-sandbox.bolt.com/v1/merchant/transactions/BR6G-B6KH-WXBX
    body:
      encoding: US-ASCII
      string: ''
    headers:
      X-Nonce:
      - b25fa22d91e73f171e11a3d633424b9b
      X-Api-Key:
      - db1bd1ff3631f9c3e30d3555ad2989fa7cbed58b2344aea911aa7e2d52dba3e3
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Wed, 11 May 2022 05:16:21 GMT
      Content-Type:
      - application/json; charset=UTF-8
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
      Public-Key-Pins-Report-Only:
      - max-age=2592000;pin-sha256="OGAVOYhLZd3ADKYGFZOED1c5m1ObMlRv9PyIWrO4Nd0=";pin-sha256="RRM1dGqnDFsCJXBTHky16vi1obOlCgFFn/yOhI/y+ho=";pin-sha256="IXHYSIdST+XY22J5ivybYkntMIfjA5P6pMKX2hWG1BE=";report-uri="https://77aa1bd121ef22d50247a23390ce6cff.report-uri.io/r/default/hpkp/reportOnly"
      Set-Cookie:
      - trk=7bf1bdfb-5a8e-487e-9768-b6401487ed21; Path=/; Max-Age=31536000; HttpOnly;
        Secure; SameSite=None
      Strict-Transport-Security:
      - max-age=31536000; includeSubDomains; preload
      X-Bolt-Api-Version:
      - '2022-01-01'
      X-Bolt-Trace-Id:
      - Root=1-627b46a5-6d10bee8474694f4529fc6b4
      X-Device-Id:
      - 47502f830c556328d2b7ffeca8c4000d9f1cb1085ec18f3bcf28c9395d05ee24
      X-Envoy-Upstream-Service-Time:
      - '57'
      Server:
      - envoy
    body:
      encoding: UTF-8
      string: '{"id":"TA6ycQqjStRQ9","type":"cc_payment","processor":"vantiv","date":1652246177175,"reference":"BR6G-B6KH-WXBX","status":"authorized","from_consumer":{"id":"CA3WXceXonaTM","first_name":"John","last_name":"Doe","phones":[{"id":"","number":"+1
        5555550199","country_code":"1","status":"","priority":""}],"emails":[{"id":"","address":"email1@example.com","status":"","priority":""}],"email_verified":false,"platform_account_status":"none"},"to_consumer":{"id":"CAgqtmLcWPErV","first_name":"Daniele","last_name":"Palombo","phones":[{"id":"PAkJjgMi179yV","number":"5555555555","country_code":"1","status":"pending","priority":"primary"}],"emails":[{"id":"EAmCbHaM6E7v8","address":"danielepalombo@nebulab.com","status":"active","priority":"primary"}],"email_verified":false,"platform_account_status":"none"},"from_credit_card":{"id":"CAhp2hhyKhdRv","last4":"1004","bin":"411111","expiration":1682899200000,"network":"visa","token_type":"bolt","priority":"listed","display_network":"Visa","icon_asset_path":"img/issuer-logos/visa.png","status":"active"},"amount":{"amount":11000,"currency":"USD","currency_symbol":"$"},"authorization":{"auth":"84076958166069130","reason":"none","status":"succeeded"},"captures":null,"merchant_division":{"id":"MA9hYSVYJ12VA","merchant_id":"MA5Ho7ftc4HPz","public_id":"Rq4qB1QajYLn","description":"Daniele
        Palombo (Nebulab)","display_name":"Solidus","logo":{"domain":"img-sandbox.bolt.com","resource":""},"platform":"none","hook_url":"https://918c9efe2fcf.ngrok.io/webhooks","hook_type":"bolt","is_universal_merchant_api":true,"is_webhooks_v2":true,"shipping_url":"","tax_url":"","debug_url":"https://asdf.ngrok.com/webhooks","confirmation_redirect_url":""},"merchant":{"created_at":"2022-03-29T21:04:10.707458Z","description":"Solidus","processor":"vantiv","operational_processors":[{"processor":"vantiv","status":"primary"}],"public_id":"CB_FtfGdUP2e","time_zone":"America/Los_Angeles","onboarding_status":"LEGACY"},"transaction_properties":{"avs_result":"34","cvv_result":"M"},"indemnification_decision":"not_indemnified","indemnification_reason":"risk_assessment_only","splits":[{"amount":{"amount":11000,"currency":"USD","currency_symbol":"$"},"type":"net"},{"amount":{"amount":0,"currency":"USD","currency_symbol":"$"},"type":"processing_fee"},{"amount":{"amount":0,"currency":"USD","currency_symbol":"$"},"type":"bolt_fee"}],"review_ticket":{"request_deadline":1652534177175},"adjust_transactions":[],"auth_verification_status":"","void_cause":"","chargeback_details":{"reason":"","reason_code":"","chargeback_amt":{"amount":0,"currency":"","currency_symbol":""},"chargeback_fee":{"amount":0,"currency":"","currency_symbol":""},"net_amt":{"amount":0,"currency":"","currency_symbol":""},"representment_result":""},"order":{"token":"2a9c6b8ce5ff30d0ca657bfff0d05b3f12a820ea029536144cfed4f1776996e6","cart":{"order_reference":"R502198337","display_id":"R502198337","currency":{"currency":"USD","currency_symbol":"$"},"subtotal_amount":{"amount":0,"currency":"USD","currency_symbol":"$"},"total_amount":{"amount":11000,"currency":"USD","currency_symbol":"$"},"discount_amount":{"amount":0,"currency":"USD","currency_symbol":"$"},"items":[{"reference":"","name":"Product
        #1 - 4860","total_amount":{"amount":0,"currency":"USD","currency_symbol":"$"},"unit_price":{"amount":1000,"currency":"USD","currency_symbol":"$"},"quantity":1,"sku":"SKU-1","type":"physical","taxable":true,"properties":[],"shipment_type":"door_delivery"}]},"external_data":{}},"refunded_amount":{"amount":0,"currency":"USD","currency_symbol":"$"},"refund_transactions":[],"refund_transaction_ids":[],"source_transaction":null,"timeline":[{"date":1652246178815,"type":"note","note":"Bolt
        Approved Order","visibility":"merchant"},{"date":1652246178219,"type":"note","note":"Authorized
        Order","consumer":{"id":"CAh4gdi2qvcXx","first_name":"John","last_name":"Doe"},"visibility":"merchant"},{"date":1652246177185,"type":"note","note":"Created
        Order","consumer":{"id":"CAh4gdi2qvcXx","first_name":"John","last_name":"Doe"},"visibility":"merchant"}],"customer_list_status":{"auto_approved":false,"block_listed":false},"address_change_request_metadata":{"can_change_shipping_address":true}}'
  recorded_at: Wed, 11 May 2022 05:16:22 GMT
recorded_with: VCR 6.1.0
